Tutorials/scalarTransportQHDFoam/2D/pitzDaily/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoQGDThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.96;
    }

    equationOfState
    {
       rho		1;
    } 
    thermodynamics
    {
        Hf              0;
        Cp              1.4;
    }
    
    transport
    {
        mu   0;
        Pr   1;
        beta 0.0;
    }
}

QGD
{
    pRefCell		0;
    pRefValue		0;
    implicitDiffusion true;
    
    QGDCoeffs	constTau;
    constTauDict
    {
      Tau	1.5e-3;
    }
}
